.doom.d/config.org
** Modeline


* Test

For the error "package cl is deprecated"

 #+begin_src emacs-lisp
;; (require 'loadhist)
;; (file-dependents (feature-file 'cl))
 #+end_src

 #+RESULTS:
 | /Users/yuchenli/.emacs.d/.local/autoloads.28.1.elc | /Users/yuchenli/.emacs.d/.local/straight/build-28.1/list-utils/list-utils.elc | /Users/yuchenli/.emacs.d/.local/straight/build-28.1/persistent-soft/persistent-soft.elc |
