.doom.d/config.el

;; (require 'loadhist)
;; (file-dependents (feature-file 'cl))
